{
  "intro_story": [
    "It's the year 2050. Recent breakthroughs in space technology have made it more common to use robots for space missions. This method of space exploration requires less resource and time, as robots don't need food, drink and oxygen, and their batteries can be recharged using solar panel.",
    "Mark, an astronaut robot, is travelling through space in search for life outside planet Earth. Things have been quite good so far, ...",
    "...when suddenly, an asteroid flies past, colliding with his spaceship. The collision destroyed the rear compartment of the ship, forcing him to perform a crash landing.",
    "Fortunately, Mark managed to land on a nearby planet. Now, he's seeking for help to repair his severely damaged spacecraft.",
    "After a while, Mark found a vehicle rescuer named Roger."
  ],
  "dialogues": [
    [
      {
        "speaker": "Roger",
        "line": "Welcome to Roger's Vehicle Rescue Service. We repair any vehicle ever existed. How can I help you?"
      },
      {
        "speaker": "Mark",
        "line": "Oh... A large meteorite hit my spacecraft and left a big hole on it."
      },
      {
        "speaker": "Roger",
        "line": "What a serious accident! Could you guide me to the spaceship's location?"
      },
      {
        "speaker": "Mark",
        "line": "Sure!"
      }
    ],
    [
      {
        "speaker": "Roger",
        "line": "Well...After quick inspection, I could see that the collision has destroyed the ship's thrusters, communication device and energy core. Repairing these will be very expensive."
      },
      {
        "speaker": "Mark",
        "line": "I know... But I have almost no cash or anything like that."
      },
      {
        "speaker": "Roger",
        "line": "No problem. There's a cave not far away. You can go down there and mine some ores for me."
      },
      {
        "speaker": "Roger",
        "line": "Just one thing, it's very dangerous down there, be careful or you might end up like your spacecraft."
      }
    ],
    [
      {
        "speaker": "Mark",
        "line": "Hi! I'm back with some ores!"
      },
      {
        "speaker": "Roger",
        "line": "Well done! Here's your {part}."
      }
    ],
    [
      {
        "speaker": "Roger",
        "line": "Well...Your spacecraft is fully fixed."
      },
      {
        "speaker": "Mark",
        "line": "Wow! Thank you so much for your help!"
      },
      {
        "speaker": "Roger",
        "line": "You're welcome!"
      }
    ]
  ],
  "boss_fight": [
    {
      "intro": ["With Roger's help, Mark is confident that he can contiue his journey.", "But he's seriously wrong! An angry giant is blocking his way, ready to smash him to pieces."]
    },
    {
      "dialogue": [
        {
          "speaker": "Monster",
          "line": "How dare you killed my people! I won't let you get away with that!"
        }
      ]
    }
  ]

}